app/controllers/comments_controller.rb

  def create
    current_user.comments.create(comment_params)
---
INSERT INTO "comments" ("commentable_id", "commentable_type", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commentable_id", 1], ["commentable_type", "Link"], ["body", "This is a comment yo"], ["user_id", 1], ["created_at", "2015-07-05 20:57:27.915774"], ["updated_at", "2015-07-05 20:57:27.915774"]]

  def destroy
    current_user.comments.destroy(params[:id])
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]

  def upvote
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 5]]

  def downvote
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 9]]