app/controllers/links_controller.rb

SELECT  "links".* FROM "links"  ORDER BY cached_votes_up DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "links"
---
  def index
    @links = Link.order("cached_votes_up DESC").page(params[:page])

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Linkers the linky link"], ["url", "www.google.com"], ["user_id", 1], ["created_at", "2015-07-02 15:48:03.794247"], ["updated_at", "2015-07-02 15:48:03.794247"]]
---
  def create
    @link = current_user.links.build(link_params)

    if @link.save